<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"e3255695beea00fb60e6b1ee40ab81c2983526f727e496b60359049406b7ad40","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1357 at https://github.com/cal-itp/data-infra/actions/runs/21004238511","plan_out_hash":"5a4c5169865bbf84e868937edf51c53424570cac6050cc33a4bd2b5aa2935b55","plan_hash":"10088774bee8f9dc00c31b7610b1bbe0e8d72cfcf6f6c0bfb328acb27ec15527","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "Zy2GKg==" -> (known after apply)
!~      detect_md5hash      = "RjOAKG6YBcxfXjaKjzn+hg==" -> "different hash"
!~      generation          = 1768344772920956 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "RjOAKG6YBcxfXjaKjzn+hg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "qMVsJQ==" -> (known after apply)
!~      detect_md5hash      = "ubc1Bo55Bjtl4oHuRUfuHw==" -> "different hash"
!~      generation          = 1768344774548840 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "ubc1Bo55Bjtl4oHuRUfuHw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1357](https://github.com/cal-itp/data-infra/actions/runs/21004238511)